import streamlit as st

r"""
### :green[$\text{NumPy (Numerical Python)}$]

$\textbf{NumPy}$ — ключевая библиотека Python для работы с многомерными массивами, матрицами и большими данными.  
Простота, высокая производительность и гибкость делают NumPy фундаментом экосистемы Python для анализа данных и научных вычислений. 

#### 🔹 $\textbf{Зачем нужен NumPy}$

Используется для:
- анализа данных и статистики;
- машинного обучения;
- обработки изображений и сигналов;
- научных и инженерных расчётов.

#### 🔹 $\textbf{Особенности}$

1. **Массивы $ndarray$** — быстрые многомерные массивы с одинаковым типом данных.  
2. **Разные типы данных** — целые, вещественные, комплексные и логические.  
3. **Гибкие операции** — изменение формы, объединение, фильтрация и сортировка массивов.  
4. **Высокая производительность** — благодаря реализации на C.  
5. **Векторизация** — операции над массивами без циклов: $A + B$, $A \times 2$, $\sin(A)$.  
6. **Математический функционал** — линейная алгебра, статистика, тригонометрия, Фурье и др.  
7. **Интеграция** — база для Pandas, SciPy, Matplotlib, scikit-learn.
"""
