import streamlit as st

r"""
:green[NumPy] (Numerical Python) — это одна из основных библиотек для научных вычислений в Python. Она предоставляет мощные инструменты для работы с многомерными массивами и матрицами, а также включает в себя широкий набор математических функций для выполнения операций над этими массивами.
* Основные характеристики NumPy:
    * ***Массивы***: В центре NumPy находится объект ndarray, который представляет собой многомерный массив. Он позволяет хранить данные одного типа и обеспечивает высокую производительность при выполнении операций над массивами.
    * ***Поддержка различных типов данных***: NumPy поддерживает различные типы данных, включая целые числа, числа с плавающей запятой, комплексные числа и логические значения, что позволяет работать с данными разных форматов.
    * ***Удобные функции для манипуляции массивами***: NumPy предлагает множество функций для изменения формы массивов, их объединения, разбиения и выполнения других манипуляций, что делает обработку данных более гибкой и удобной.
    * ***Эффективность***: NumPy оптимизирован для выполнения операций над массивами, что делает его значительно быстрее, чем стандартные списки Python, особенно при работе с большими объемами данных.
    * ***Унифицированные операции***: Библиотека поддерживает векторизацию, что позволяет выполнять операции над массивами без необходимости использования циклов. Это упрощает код и улучшает его читаемость.
    * ***Математические функции***: NumPy предоставляет широкий набор встроенных математических функций, включая линейную алгебру, статистику, трансформации Фурье и многие другие.
    * ***Интеграция с другими библиотеками***: NumPy является основой для многих других библиотек в экосистеме Python, таких как SciPy, Pandas, Matplotlib и др., что делает его важным инструментом для научных и инженерных расчетов.
"""
